# Permeability Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ThermalAsset..::..Permeability Property
ThermalAsset Class See Also
---
The permeability of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Permeability { get; set; }
```

Visual Basic
---
```text
Public Property Permeability As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Permeability {
	double get ();
	void set (double value);
}
```

# Remarks
Values are in seconds per foot (s/ft) and must be non-negative.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for permeability must be non-negative. |

# See Also
ThermalAsset Class
Autodesk.Revit.DB Namespace